IRP/src/Documents/PurchaseOrderClosing/PurchaseOrderClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>PurchaseOrderClosing</name>
 <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R3025B_PurchaseOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R1012B_PurchaseOrdersInvoiceClosing</registerRecords>
 <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
 <registerRecords>AccumulationRegister.R1014T_CanceledPurchaseOrders</registerRecords>
 <registerRecords>AccumulationRegister.R4016B_InternalSupplyRequestOrdering</registerRecords>
 <registerRecords>AccumulationRegister.R1010T_PurchaseOrders</registerRecords>
 <registerRecords>AccumulationRegister.R4033B_GoodsReceiptSchedule</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R1011B_PurchaseOrdersReceipt</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>PurchaseOrder</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.PurchaseTransactionTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Cancel</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>CancelReason</name>
   <type>
    <types>CatalogRef.CancelReturnReasons</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>DeliveryDate</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PurchaseOrderKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R1011B_PurchaseOrdersReceipt/R1011B_PurchaseOrdersReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R1011B_PurchaseOrdersReceipt</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseReturnOrder</types>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowKey</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R1012B_PurchaseOrdersInvoiceClosing/R1012B_PurchaseOrdersInvoiceClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R1012B_PurchaseOrdersInvoiceClosing</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>NetAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseReturnOrder</types>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowKey</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R4033B_GoodsReceiptSchedule/R4033B_GoodsReceiptSchedule.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R4033B_GoodsReceiptSchedule</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeOrders</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowKey</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R4035B_IncomingStocks/R4035B_IncomingStocks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R4035B_IncomingStocks</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.InventoryTransferOrder</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R3025B_PurchaseOrdersToBePaid/R3025B_PurchaseOrdersToBePaid.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R3025B_PurchaseOrdersToBePaid</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R1020B_AdvancesToVendors/R1020B_AdvancesToVendors.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R1020B_AdvancesToVendors</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>VendorsAdvancesClosing</name>
  <type>
   <types>DocumentRef.VendorsAdvancesClosing</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R1021B_VendorsTransactions/R1021B_VendorsTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R1021B_VendorsTransactions</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>VendorsAdvancesClosing</name>
  <type>
   <types>DocumentRef.VendorsAdvancesClosing</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeApTransactionBasises</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R5012B_VendorsAging/R5012B_VendorsAging.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R5012B_VendorsAging</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>AgingClosing</name>
    <type>
      <types>DocumentRef.VendorsAdvancesClosing</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransactionCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ApArPostingDetail/ApArPostingDetail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ApArPostingDetail</name>
 <enumValues>
  <name>ByDocuments</name>
 </enumValues>
 <enumValues>
  <name>ByAgreements</name>
 </enumValues>
 <enumValues>
  <name>ByStandardAgreement</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/PurchaseOrderClosing/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure;
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	
	If ValueIsFilled(Ref.PurchaseOrder) Then
		Tables.Insert("CurrencyTable", Ref.PurchaseOrder.Currencies.Unload());
	EndIf;
	
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map;
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Tables = PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure;
	StrParams.Insert("PurchaseOrder", Ref.PurchaseOrder);
	StrParams.Insert("Period", Ref.Date);
	If ValueIsFilled(Ref) Then
		StrParams.Insert("BalancePeriod", New Boundary(Ref.PointInTime(), BoundaryType.Excluding));
	Else
		StrParams.Insert("BalancePeriod", Undefined);
	EndIf;
	Return StrParams;
EndFunction

#EndRegion

#Region Posting_SourceTable

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	QueryArray.Add(ItemList());
	Return QueryArray;
EndFunction

Function ItemList()
	Return "SELECT
		   |	Closing.Ref.Date AS Period,
		   |	Order.Ref.Company,
		   |	Order.Ref.Branch,
		   |	Order.Ref.Currency,
		   |	Order.Ref AS Order,
		   |	Order.ItemKey,
		   |	Order.Key AS RowKey,
		   |	Closing.Cancel,
		   |	Closing.CancelReason,
		   |	Order.IsService,
		   |	Closing.QuantityInBaseUnit AS Quantity,
		   |	CASE
		   |		WHEN Order.QuantityInBaseUnit = 0
		   |			THEN 0
		   |		ELSE CASE
		   |			WHEN Order.QuantityInBaseUnit = Closing.QuantityInBaseUnit
		   |				THEN Order.TotalAmount
		   |			ELSE Order.TotalAmount / Order.QuantityInBaseUnit * Closing.QuantityInBaseUnit
		   |		END
		   |	END AS TotalAmount,
		   |	CASE
		   |		WHEN Order.QuantityInBaseUnit = 0
		   |			THEN 0
		   |		ELSE CASE
		   |			WHEN Order.QuantityInBaseUnit = Closing.QuantityInBaseUnit
		   |				THEN Order.NetAmount
		   |			ELSE Order.NetAmount / Order.QuantityInBaseUnit * Closing.QuantityInBaseUnit
		   |		END
		   |	END AS NetAmount,
		   |	CASE
		   |		WHEN Order.QuantityInBaseUnit = 0
		   |			THEN 0
		   |		ELSE CASE
		   |			WHEN Order.OffersAmount = Order.QuantityInBaseUnit
		   |				THEN Order.OffersAmount
		   |			ELSE Order.OffersAmount / Order.QuantityInBaseUnit * Closing.QuantityInBaseUnit
		   |		END
		   |	END AS OffersAmount
		   |INTO ItemList
		   |FROM
		   |	Document.PurchaseOrder.ItemList AS Order
		   |		INNER JOIN Document.PurchaseOrderClosing.ItemList AS Closing
		   |		ON Order.Ref = Closing.Ref.PurchaseOrder
		   |		AND Order.Key = Closing.PurchaseOrderKey
		   |		AND Closing.Ref = &Ref";
EndFunction

#EndRegion

#Region Posting_MainTables

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(R1010T_PurchaseOrders());
	QueryArray.Add(R1011B_PurchaseOrdersReceipt());
	QueryArray.Add(R1012B_PurchaseOrdersInvoiceClosing());
	QueryArray.Add(R1014T_CanceledPurchaseOrders());
	QueryArray.Add(R1020B_AdvancesToVendors());
	QueryArray.Add(R1021B_VendorsTransactions());
	QueryArray.Add(R3025B_PurchaseOrdersToBePaid());
	QueryArray.Add(R4033B_GoodsReceiptSchedule());
	QueryArray.Add(R4035B_IncomingStocks());
	QueryArray.Add(R5012B_VendorsAging());
	QueryArray.Add(T2014S_AdvancesInfo());
	Return QueryArray;
EndFunction

Function R1010T_PurchaseOrders()
	Return "SELECT
		   |	ItemList.Period,
		   |	ItemList.Company,
		   |	ItemList.Branch,
		   |	ItemList.Currency,
		   |	ItemList.Order,
		   |	ItemList.ItemKey,
		   |	ItemList.RowKey,
		   |	-ItemList.Quantity AS Quantity,
		   |	-ItemList.TotalAmount AS Amount,
		   |	-ItemList.NetAmount AS NetAmount
		   |INTO R1010T_PurchaseOrders
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	ItemList.Cancel
		   |
		   |UNION ALL
		   |
		   |select
		   |	ItemList.Period,
		   |	ItemList.Company,
		   |	ItemList.Branch,
		   |	ItemList.Currency,
		   |	ItemList.Order,
		   |	ItemList.ItemKey,
		   |	ItemList.RowKey,
		   |	ItemList.Quantity AS Quantity,
		   |	ItemList.TotalAmount AS Amount,
		   |	ItemList.NetAmount AS NetAmount
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	NOT ItemList.Cancel";
EndFunction

Function R1011B_PurchaseOrdersReceipt()
	Return "SELECT
		   |	&Period AS Period,
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	-Balance.QuantityBalance AS Quantity,
		   |	*
		   |INTO R1011B_PurchaseOrdersReceipt
		   |FROM
		   |	AccumulationRegister.R1011B_PurchaseOrdersReceipt.Balance(&BalancePeriod, Order = &PurchaseOrder) AS Balance";
EndFunction

Function R1012B_PurchaseOrdersInvoiceClosing()
	Return "SELECT
		   |	&Period AS Period,
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	-PurchaseOrdersInvoiceClosing.QuantityBalance AS Quantity,
		   |	-PurchaseOrdersInvoiceClosing.AmountBalance AS Amount,
		   |	-PurchaseOrdersInvoiceClosing.NetAmountBalance AS NetAmount,
		   |	*
		   |INTO R1012B_PurchaseOrdersInvoiceClosing
		   |FROM
		   |	AccumulationRegister.R1012B_PurchaseOrdersInvoiceClosing.Balance(&BalancePeriod, Order = &PurchaseOrder) AS
		   |		PurchaseOrdersInvoiceClosing";
EndFunction

Function R1014T_CanceledPurchaseOrders()
	Return "SELECT
		   |	ItemList.Period,
		   |	ItemList.Company,
		   |	ItemList.Branch,
		   |	ItemList.Currency,
		   |	ItemList.Order,
		   |	ItemList.ItemKey,
		   |	ItemList.RowKey,
		   |	ItemList.CancelReason,
		   |	ItemList.Quantity AS Quantity,
		   |	ItemList.TotalAmount AS Amount,
		   |	ItemList.NetAmount AS NetAmount
		   |INTO R1014T_CanceledPurchaseOrders
		   |FROM
		   |	ItemList AS ItemList
		   |WHERE
		   |	ItemList.Cancel";
EndFunction

Function R4033B_GoodsReceiptSchedule()
	Return "SELECT
		   |	&Period AS Period,
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	-IncomingStocks.QuantityBalance AS Quantity,
		   |	*
		   |INTO R4033B_GoodsReceiptSchedule
		   |FROM
		   |	AccumulationRegister.R4033B_GoodsReceiptSchedule.Balance(&BalancePeriod, Basis = &PurchaseOrder) AS IncomingStocks";
EndFunction

Function R4035B_IncomingStocks()
	Return "SELECT
		   |	&Period AS Period,
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	-IncomingStocks.QuantityBalance AS Quantity,
		   |	*
		   |INTO R4035B_IncomingStocks
		   |FROM
		   |	AccumulationRegister.R4035B_IncomingStocks.Balance(&BalancePeriod, Order = &PurchaseOrder) AS IncomingStocks";
EndFunction

Function R3025B_PurchaseOrdersToBePaid()
	Return "SELECT
		   |	&Period AS Period,
		   |	VALUE(AccumulationRecordType.Expense) AS RecordType,
		   |	Balance.AmountBalance AS Amount,
		   |	*
		   |INTO R3025B_PurchaseOrdersToBePaid
		   |FROM
		   |	AccumulationRegister.R3025B_PurchaseOrdersToBePaid.Balance(&BalancePeriod, Order = &PurchaseOrder) AS Balance";
EndFunction

Function T2014S_AdvancesInfo()
	Return 
		"SELECT
		|	Doc.Date,
		|	Doc.Company,
		|	Doc.Branch,
		|	Doc.Currency,
		|	Doc.Partner,
		|	Doc.LegalName,
		|	case
		|		when Doc.Agreement.ApArPostingDetail = VALUE(Enum.ApArPostingDetail.ByDocuments)
		|			Then Doc.Agreement
		|		else Undefined
		|	end AS AdvanceAgreement,
		|	Doc.Ref AS Order,
		|	TRUE AS IsVendorAdvance,
		|	TRUE AS IsPurchaseOrderClose
		|INTO T2014S_AdvancesInfo
		|FROM
		|	Document.PurchaseOrder AS Doc
		|WHERE
		|	Doc.Ref = &PurchaseOrder";
EndFunction

Function R1020B_AdvancesToVendors()
	Return AccumulationRegisters.R1020B_AdvancesToVendors.R1020B_AdvancesToVendors_PI_PR_POC_SRTC();
EndFunction

Function R1021B_VendorsTransactions()
	Return AccumulationRegisters.R1021B_VendorsTransactions.R1021B_VendorsTransactions_POC();
EndFunction

Function R5012B_VendorsAging()
	Return AccumulationRegisters.R5012B_VendorsAging.R5012B_VendorsAging_Offset();
EndFunction

#EndRegion

#Region AccessObject

// Get access key.
// 
// Parameters:
//  Obj - DocumentObjectDocumentName -
// 
// Returns:
//  Map
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	AccessKeyMap.Insert("Branch", Obj.Branch);
	StoreList = Obj.ItemList.Unload(, "Store");
	StoreList.GroupBy("Store");
	AccessKeyMap.Insert("Store", StoreList.UnloadColumn("Store"));
	Return AccessKeyMap;
EndFunction

#EndRegion
